import sqlite3

# 连接到数据库，如果不存在则创建一个新的数据库
conn = sqlite3.connect('鸿天光伏电站')

# 创建一个游标对象
cursor = conn.cursor()

# 插入一些数据
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('1', '送出线路','送出线路','2xJL/G1A-300/40','','','10.34','km','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('1', '送出线路','送出线路','ZC-YJLW03-64/110kV 1-1600mm','江苏长峰电缆有限公司','','6.336','km','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('2', 'GIS','GIS','ZF23-126','西安西电高压开关有限公司','500MW','9个间隔','个','126kV','2kA','1600/1','800/1','800/1',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('3', '主变','主变本体','SFZ18-125000/110-NX3','江苏华鹏变压器有限公司','125000kVA','4','台','(115±8*1.25%)/37kV','627.6A','1200/1','1200/1','1200/1',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','主变进线柜','KYN61-40.5铠装移开式交流金属封闭开关设备','山东泰开真空开关有限公司','','','台','40.5kV','1250A','2500/1','2500/1','2500/1',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','接地变本体','DKSC-800','思源电气股份有限公司','800kVA','1','台','37kV','','400/1','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','接地变开关柜','KYN61-40.5铠装移开式交流金属封闭开关设备','山东泰开真空开关有限公司','','4','台','40.5kV','主母排2500A，分支排1250A，互感器100A','600/1','100/1','100/1',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','SVG本体','FGSVG-C37.5/35-0-W','新风光电子科技股份有限公司','±37.5Mvar','4','台','35kV','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','SVG开关柜','KYN61-40.5铠装移开式交流金属封闭开关设备','山东泰开真空开关有限公司','','4','台','40.5kV','主母排2500A，分支排1250A，互感器800A','800/1','800/1','800/1',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','400V站用变本体','SCB11-800/35','山东泰开箱变有限公司','800kVA','1','台','37±2×2.5%/0.4kV','12.48/1154.7A','','','',''))
#
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','10kV站用变本体','YBW-12/0.8-800','临沂友诚电气有限公司','800kVA','1','台','12/0.4kV','46.2/1155A','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','站用变开关柜','KYN61-40.5铠装移开式交流金属封闭开关设备','山东泰开真空开关有限公司','','1','台','40.5kV','主母排2500A，分支排1250A，互感器100A','600/1','100/1','100/1',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','PT','KYN61-40.5铠装移开式交流金属封闭开关设备','山东泰开真空开关有限公司','','4','台','40.5kV','主母排2500A','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('4', '高压开关设备','线路开关柜','KYN61-40.5铠装移开式交流金属封闭开关设备','山东泰开真空开关有限公司','','20','台','40.5kV','主母排2500A，分支排1250A，互感器800A','800/1','800/1','800/1',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('5', '400V配电系统','万能式断路器','TGW1N-2000H','浙江天正电气股份有限公司','','1','台','415/690V','2000A','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('5', '400V配电系统','低压成套开关设备','MNS','山东泰开真空开关有限公司','','9','套','AC380V','1000A','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('6', '集电线路','集电线路','ZRC-YJLHY23-26/35-3×95','江苏长峰电缆有限公司','','21272','m','电压等级26/35','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('6', '集电线路','集电线路','ZRC-YJLHY23-26/35-3×150','江苏长峰电缆有限公司','','7206','m','电压等级26/35','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('6', '集电线路','集电线路','ZRC-YJLHY23-26/35-3×240','江苏长峰电缆有限公司','','8311','m','电压等级26/35','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('6', '集电线路','集电线路','ZRC-YJLHY63-26/35-1x300','江苏长峰电缆有限公司','','21120','m','电压等级26/35','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('6', '集电线路','集电线路','ZRC-YJLHY63-26/35-1×400','江苏长峰电缆有限公司','','67580','m','电压等级26/35','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('6', '集电线路','集电线路','ZRC-YJLHY63-26/35-1×500','江苏长峰电缆有限公司','','85047','m','电压等级26/35','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('6', '集电线路','集电线路','ZRC-YJLHY23-0.6/1-3×120','江苏长峰电缆有限公司','','426266','m','电压等级26/35','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('7', '箱变	','箱变','S11-3125/35 Yd11 7% 37±2×2.5%/0.8kV','山东泰开箱变有限公司','3.125MW','96','台','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('7', '箱变	','箱变','S11-3125/35 Yd11 7% 37±2×2.5%/0.8kV','泰山','3.125MW','64','台','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('8', '逆变器','逆变器','SUN2000-196KTL-H0','华为技术有限公司','','2551','台','输出电压800V','最大输出电流155.9A','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','110kV线路保护装置','NSR-305DLM','国电南瑞科技股份有限公司','','2','台','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','110kV母线保护装置','NSR-371AL','国电南瑞科技股份有限公司','','1','台','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','主变保护装置','NSR-378LD','国电南瑞科技股份有限公司','','4','台','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','35kV母线保护装置','NSR-371','国电南瑞科技股份有限公司','','4','台','','','','','',''))
#
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','光功率预测','EEE-PDT','东润环能（北京）科技有限公司','','1','台','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','故障录波','WDGL-VI-G','山东山大电力技术股份有限公司','','4','台','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','稳控装置','FWK-C','江苏华瑞泰科技股份有限公司','','1','套','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','稳控装置(从机)','PCS-992','国电南瑞科技股份有限公司','','1','套','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('9', '综合自动化装置及继电保护装置','AGC/AVC装置','NSC2200E','国电南瑞科技股份有限公司','','1','套','','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('10', '直流系统','直流馈电屏','PYD20-K','许继电源有限公司','','3','台','AC380V','直流120A','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('10', '直流系统','电池柜','GFMD-600C(2V600Ah)','山东圣阳电源股份有限公司','蓄电池组600Ah','104','块','DC220V','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('11', 'UPS系统','UPS电源屏','XJ-PYD20-N-30kVA','许继电源有限公司','30kVA','2','台','AC380V','','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('11', 'UPS系统','UPS馈线屏','PYD20-N','许继电源有限公司','蓄电池组600Ah,UPS容量2×30kVA','2','台','AC380V','直流120A','','','',''))
# cursor.execute('''
#     INSERT INTO 设备基础信息统计表 (序号, 主项目,项目,型号,厂家,容量,数量,单位,额定电压,额定电流,互感器保护变比,互感器计量变比,互感器测量变比,备注)
#     VALUES (?, ?,?,?,?,?,?, ?,?,?,?,?,?,?)
# ''', ('12', '通讯系统	','通讯系统','NSC2200E','国电南瑞科技股份有限公司','','1','台','','','','','',''))

# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司, 姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('35kV SF6气体在线检测装置', '姜威豪','15865175398',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司, 姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('调度数据网，二次安防', '曹淼','13152171239',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司, 姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('故障录波', '樊建功','18615560705',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司, 姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('国电南瑞', '李佳琦','17809267847',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司, 姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('五防厂家', '陈虎','15753803919',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司, 姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('功率预测厂家', '龙耀辉','18700306277',''))

# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('1', '安华','13519108042','站长',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('2', '曹征','18893611864','值长',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('3', '卢奥琪','13150369313','值长',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('4', '包小龙','17318737295','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('5', '锁铭旺','17389415282','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('6', '叶家琪','13040979343','安全员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('7', '尚会军','1321846666','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('8', '商恒博','15991782216','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('9', '柳琪琪','18794820039','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('10', '于龙辉','15886785028','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('11', '朱嘉航','15029381583','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('12', '张永杰','18709376664','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('13', '吴昊','15829759257','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('14', '胡红红','19958686965','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('15', '郝荣','18891870289','职员',''))
# cursor.execute('''
#     INSERT INTO 场站人员名单 (序号, 姓名,电话,职位,备注)
#     VALUES (?, ?,?,?,?)
# ''', ('16', '田申','15027224531','值长',''))

# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('安华', '13519108042','站长','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('曹征', '18893611864','值长','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('卢奥琪', '13150369313','值长','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('包小龙', '17318737295','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('锁铭旺', '17389415282','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('叶家琪', '13040979343','安全员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('尚会军', '1321846666','后勤人员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('商恒博', '15991782216','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('柳琪琪', '18794820039','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('于龙辉', '15886785028','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('朱嘉航', '15029381583','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('张永杰', '18709376664','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('吴昊', '15829759257','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('胡红红', '19958686965','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('郝荣', '18891870289','职员','2024.1.1','2024.1.8','7',''))
# cursor.execute('''
#     INSERT INTO 场站休假人员名单 (姓名,电话,职位,休假起始时间,休假结束时间,休假时长,备注)
#     VALUES (?, ?,?,?,?,?,?)
# ''', ('田申', '15027224531','值长','2024.1.1','2024.1.8','7',''))

# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('充氮灭火器厂家', '','15110489500',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('电能量采集终端（华立）', '郭焕明','18234903731',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('电能量采集终端（威思顿）', '吴昊迪','17664162534',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('小电阻接地变成套装置', '郭工','15316011618',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('GIS（西电）', '巩晓龙','18710888837',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('主变（华鹏）', '颜工','13961173363',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('35kV，400V开关柜（泰开）', '陈腾','15264820992',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('SVG（新风光）', '刘工','15092729997',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('数据网，网络安全监测', '杨科','17629014353',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('光端机通信（西安德悦）', '许伟伟','17389280070',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('交直流（许继电源）', '范少杰','18538675249',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('交直流（许继电源）', '李亚光','17796691205',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('主变温控箱（福建力得）', '黎工','18060830359',''))
# cursor.execute('''
#     INSERT INTO 厂家联系方式 (公司,姓名,电话,备注)
#     VALUES (?, ?,?,?)
# ''', ('站用变（泰开箱变）', '高璞','18005380207',''))
# # 执行查询语句
# cursor.execute('SELECT * FROM 厂家联系方式')

# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('五防机', 'ZD230556','wfop1','root','rootroot','凝思80','','198.1.1.41',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('AGC/AVC机', 'ZD230556','agcop1','oracle','ns2000','凝思60','ns3000','198.100.100.202',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('光功率预测机', 'ZD230556','glycop1','root','rootroot','凝思80','','',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('拷贝工作站', 'ZD230556','copy1','root','rootroot','凝思60','','198.1.1.31',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('OMS', 'ZD230556','OMS1','administrator','nsps_1234','WIN10-64','','',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('光伏区主机', 'ZD230556','gfsca1-1','ems','nsd5000','凝思80','D5000','198.1.1.98',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('光伏区备机', 'ZD230556','gfsca2-1','ems','nsd5000','凝思80','','198.1.1.99',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('升压站主机', 'ZD230556','sca1-1','ems','nsd5000','凝思80','D5000','198.1.1.3',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('升压站备机', 'ZD230556','sca2-1','ems','nsd5000','凝思80','D5000','198.1.1.4',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('保护及故障信息子站柜', 'ZD230556','bx1','oracle','Ns@20001','','','198.100.100.150',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('二次安防柜', '','日志审计与分析系统','admin','wnt8000LLy&y','','','','管理接口：GEO；管理地址：https://192.168.1.168:8440'))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('快速频率控制柜', 'ZD230556','kp1','oracle','ns2000','凝思60','ns3000','193.100.100.210',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('AGC/AVC控制系统柜（服务器1，4n）', 'ZD230556','agc1','oracle','ns2000','凝思60','ns3000','193.100.100.200',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('AGC/AVC控制系统柜（服务器2，5n）', 'ZD230556','agc2','oracle','ns2000','凝思60','ns3000','',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('历史服务器柜（服务器1，4n）', 'ZD230556','his1-1','ems','nsd5000','凝思80','D5000','198.1.1.1',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('历史服务器柜（服务器2，5n）', 'ZD230556','his2-1','ems','nsd5000','凝思80','D5000','198.1.1.2',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('数据处理服务器柜（服务器1，4n）', 'ZD230556','fes1-1','ems','nsd5000','凝思80','D5000','198.1.1.5',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('数据处理服务器柜（服务器2，5n）', 'ZD230556','fes2-1','ems','nsd5000','凝思80','D5000','198.1.1.6',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('光功率服务器柜（服务器1，最上侧）', 'ZD230556','glyc2','root','rootroot','凝思80','','',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('光功率服务器柜（服务器2，中间侧）', 'ZD230556','qxsj1','root','rootroot','凝思80','','',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('光功率服务器柜（服务器2，最下侧）', 'ZD230556','glyc1','root','rootroot','凝思80','','',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('SDH通信设备柜', '','','root','Password@123456','','','',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('故障录波柜', '','','sduept','sduept!@123','','','','临时用户密码：0'))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('监控室后台', '','','admin','admin123','','','',''))
# cursor.execute('''
#     INSERT INTO 设备用户及密码 (设备名,合同号,机器名,用户名,密码,系统信息,软件信息,ip地址,备注)
#     VALUES (?,?,?,?,?,?, ?,?,?)
# ''', ('电能量信息采集（华立）', '','','admin','111111','','','',''))
# # 执行查询语句
# cursor.execute('SELECT * FROM 设备用户及密码')

# 获取查询结果
results = cursor.fetchall()

# 打印结果
for row in results:
    print(row)

# 提交更改并关闭连接
conn.commit()
conn.close()